const dataHistory = [
  {
    until: true,
    year: 2019,
    title: "高校時代は吹奏楽部に所属",
    content: (
      <>
        <p>高校では吹奏楽部に所属し、<a href="https://www.japan-mba.org/" target="_blank" rel="noreferrer noopener">一般社団法人日本マーチングバンド協会</a>が主催するマーチング全国大会に出場。在籍中に二度の日本一を経験した。</p>
      </>
    )
  },
  {
    year: 2020,
    month: 1,
    day: 1,
    title: "情報系の勉強をはじめる",
    content: (
      <>
        <p>将来は、昔から興味のあった<span>サイバーセキュリティ分野</span>で働きたいと考えていたため、タイピングの練習やプログラミングの勉強をはじめる。</p>
        <p>この時は、タイピングもまともに出来ないレベルであり、もちろん情報工学についての知識もゼロに等しい状態であった。</p>
      </>
    )
  },
  {
    year: 2020,
    month: 3,
    title: "ITパスポートに合格",
    content: (
      <>
        <p>試験2週間前にITパスポートの書籍を購入し勉強を始め、<span>無事合格。</span></p>
      </>
    )
  },
  {
    year: 2020,
    month: 4,
    title: "大学に入学",
    content: (
      <>
        <p>東京電機大学 未来科学部 情報メディア学科に進学。</p>
        <p>当時は、コロナ禍であり入学式もオンラインで行われ、授業が始まったのも5月頃であった。その授業もオンラインで行われ、大学に登校しての授業は翌年に再開した。</p>
      </>
    )
  },
  {
    year: 2020,
    month: 12,
    title: "Web制作会社でアルバイトをはじめる",
    content: (
      <>
        <p>Web関連の技術に興味を持ちWeb制作会社のアルバイトに応募。<span>無事合格</span>し勤務をはじめる。そこでは、不動産系のサイトの保守管理を担当した。</p>
      </>
    )
  },
  {
    year: 2021,
    month: 4,
    title: "基本情報技術者試験に合格",
    content: (
      <>
        <p>本来は前年度の10月に受ける予定であったがコロナ禍で延期。結果は<span>無事合格</span>。</p>
      </>
    )
  },
  {
    year: 2022,
    month: 8,
    title: "NTTデータ先端技術株式会社の夏インターンに参加",
    content: (
      <>
        <p>脅威インテリジェンスを活用して、企業のセキュリティ対策を検討、提案した。</p>
      </>
    )
  },
  {
    year: 2022,
    month: 9,
    title: "株式会社インフォセックの夏インターンに参加",
    content: (
      <>
        <p>セキュリティ業務の一連の流れを学ぶ。</p>
      </>
    )
  },
  {
    year: 2022,
    month: 12,
    title: "セキュリティ・ミニキャンプ in 東京に参加",
    content: (
      <>
        <p>Bトラックの<span>「ウェブアプリ診断入門 ハンズオン」</span>に参加し、Webアプリの脆弱性診断について学ぶ。</p>
      </>
    )
  },
  {
    year: 2023,
    month: 1,
    title: "情報処理安全確保支援士試験に合格",
    content: (
      <>
        <p>令和4年度秋期の情報処理安全確保支援士試験に挑戦し、<span>無事合格！</span></p>
      </>
    )
  },
  {
    year: 2023,
    month: 5,
    title: "セキュリティ系の会社でアルバイト開始",
    content: (
      <>
        <p>セキュリティ系の会社でアルバイトを始め、AWSやterraformなどインフラ領域の技術をいじり始める。</p>
      </>
    )
  },
  {
    year: 2023,
    month: 5,
    title: "セキュリティ・ミニキャンプ in 東京に参加",
    content: (
      <>
        <p>2度目の参加。Cトラックの<span>「マルウェア解析入門」</span>に参加し、マルウェア解析について学ぶ。</p>
      </>
    )
  }
]

export default dataHistory;